package HW1.task4;
/*Создать класс калькулятор.
        В нем создать методы:
        summ, minus, multiply, division.
        Сложение, вычитание, умножение и деление соответственно.
        Каждый метод принимает в качестве параметров два значения типа double.
        И выводит в консоль результат действия.

        Также в классе есть метод старт. Который выводит сообщение в консоль, что
        калькулятор запущен. И предлагает ввести действие в вашей консоли.

        Калькулятор должен принимать только следующие типы действий:
        2+4;    - пример синтаксиса сложения;
        5-6;    - пример синтаксиса вычитания;
        25*3;   - пример синтаксиса умножения;
        34/3;   - пример синтаксиса деления;
        После ввода действия на консоль выводится ответ этого действия.
        И после снова выводится сообщение о предложении ввести действие.

        в случае ввода другого синтаксисана консоль возвращается сообщение:
        "Введите корректное действие".
        И после снова выводится сообщение о предложении ввести действие.

        Программа закрывается после ввода команды Stop.
        Перед закрытием на консоль должно выводится сообщение:
        "Калькулятор закрыт". */
public class Main {
    public static void main(String[] args) {
        Calculator cal=new Calculator();
        cal.start();
    }
}
